//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее


// Console.WriteLine("Input first number");
// int FirNum = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Input second number");
// int SecNum = Convert.ToInt32(Console.ReadLine());

// if (FirNum < SecNum)
// {
//     Console.WriteLine($"First Number  {FirNum} < {SecNum}");
// }
// else
// {
//     Console.WriteLine($"First Number  {FirNum} > {SecNum}");
// }


//Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

Console.Write("Input first number ");
int FirNum = Convert.ToInt32(Console.ReadLine());
Console.Write("Input second number ");
int SecNum = Convert.ToInt32(Console.ReadLine());
Console.Write("Input third number ");
int ThirdNum = Convert.ToInt32(Console.ReadLine());

if (FirNum < SecNum)
{
    if (SecNum < ThirdNum)
    {
        Console.WriteLine($"Max number is {ThirdNum}");
    }
        
    else
        Console.WriteLine($"Max number is {SecNum}");
}
else
Console.WriteLine($"Max number is {FirNum}");

//Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// Console.WriteLine("Input first number");
// int Num = Convert.ToInt32(Console.ReadLine());

//     if (Num % 2 == 0)
//         Console.WriteLine($"{Num} -> чётное");
//     else
//         Console.WriteLine($"{Num} -> нечётное");
//     Num += 1;

//Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

// Console.WriteLine("Input first number");
// int Num = Convert.ToInt32(Console.ReadLine());
// int count = 1;
// while (count <= Num)
// {
//     if (count % 2 == 0)
//         Console.WriteLine(count);
//     count += 1;
// }